<?php

return [
    'validation' => [
        'name_required' => 'Укажите имя.',
        'name_string' => 'Имя должно быть строкой.',
        'name_max' => 'Имя не должно превышать 255 символов.',

        'email_required' => 'Укажите адрес электронной почты.',
        'email_invalid' => 'Укажите корректный адрес электронной почты.',
        'email_max' => 'Адрес электронной почты не должен превышать 255 символов.',

        'message_required' => 'Введите сообщение.',
        'message_string' => 'Сообщение должно быть строкой.',
        'message_max' => 'Сообщение не должно превышать 5000 символов.',
    ],
    'successes' => [
        'email_sent_successfully' => 'Письмо успешно отправлено.',
    ],
];
